[
  {
    "id": "1",
    "name": "Full Body Strength",
    "category": "Strength Training",
    "description": "A well-rounded strength training routine that targets all major muscle groups.",
    "instructions": "Perform each exercise with proper form, resting for 60-90 seconds between sets. Adjust weights as needed.",
    "exercises": [
      {
        "name": "Push-ups",
        "description": "A bodyweight exercise that strengthens the chest, shoulders, and triceps.",
        "sets": "3 sets of 15 reps",
        "instructions": "Keep your body straight, lower your chest to just above the floor, and push back up."
      },
      {
        "name": "Barbell Squat",
        "description": "A compound lower body exercise that engages the quadriceps, hamstrings, and glutes.",
        "sets": "4 sets of 10 reps",
        "instructions": "Keep feet shoulder-width apart, lower yourself by bending your knees, then push back up through your heels."
      },
      {
        "name": "Deadlifts",
        "description": "An exercise that targets the posterior chain, including hamstrings, glutes, and lower back.",
        "sets": "3 sets of 8 reps",
        "instructions": "Keep your back straight, hinge at your hips, and lift the bar by engaging your glutes and hamstrings."
      },
      {
        "name": "Pull-ups",
        "description": "A bodyweight exercise that builds back and biceps strength.",
        "sets": "3 sets of 8 reps",
        "instructions": "Grip the bar shoulder-width apart, pull yourself up until your chin is over the bar, and lower slowly."
      }
    ]
  },
  {
    "id": "2",
    "name": "Upper Body Hypertrophy",
    "category": "Muscle Growth",
    "description": "A workout designed for upper body muscle growth and endurance.",
    "instructions": "Use moderate to heavy weights, focusing on controlled movements. Rest for 45-60 seconds between sets.",
    "exercises": [
      {
        "name": "Dumbbell Shoulder Press",
        "description": "An overhead press that targets the deltoid muscles.",
        "sets": "3 sets of 12 reps",
        "instructions": "Keep your core engaged, press the dumbbells overhead, and slowly lower them back to shoulder level."
      },
      {
        "name": "Incline Bench Press",
        "description": "A variation of the bench press focusing on the upper chest.",
        "sets": "4 sets of 10 reps",
        "instructions": "Set the bench at a 30-45 degree angle, lower the bar to your chest, and press it back up."
      },
      {
        "name": "Bicep Curls",
        "description": "An isolated exercise for strengthening the biceps.",
        "sets": "3 sets of 15 reps",
        "instructions": "Keep your elbows close to your body and curl the dumbbells up without swinging."
      },
      {
        "name": "Tricep Dips",
        "description": "A bodyweight movement that strengthens the triceps.",
        "sets": "3 sets of 10 reps",
        "instructions": "Lower yourself until your elbows are at a 90-degree angle, then push yourself back up."
      }
    ]
  },
  {
    "id": "3",
    "name": "Lower Body Power",
    "category": "Strength & Conditioning",
    "description": "A workout designed to build lower body strength and power.",
    "instructions": "Focus on explosive movements and good form. Rest for 60-90 seconds between sets.",
    "exercises": [
      {
        "name": "Bulgarian Split Squat",
        "description": "A single-leg squat variation that increases balance and lower body strength.",
        "sets": "3 sets of 12 reps per leg",
        "instructions": "Place your back foot on a bench, lower yourself until your front thigh is parallel to the floor, then push back up."
      },
      {
        "name": "Romanian Deadlifts",
        "description": "A deadlift variation targeting hamstrings and glutes.",
        "sets": "3 sets of 10 reps",
        "instructions": "Hinge at the hips while keeping your back straight, lower the bar down your legs, and return to standing."
      },
      {
        "name": "Calf Raises",
        "description": "A simple exercise for strengthening the calf muscles.",
        "sets": "3 sets of 20 reps",
        "instructions": "Stand on the balls of your feet and lift your heels as high as possible before lowering back down."
      }
    ]
  },
  {
    "id": "4",
    "name": "Cardio Blast",
    "category": "Cardio",
    "description": "A high-intensity cardio workout to boost endurance and burn calories.",
    "instructions": "Perform each exercise with maximum effort, resting for 30 seconds between rounds.",
    "exercises": [
      {
        "name": "Jump Rope",
        "description": "A full-body cardio exercise that improves agility and endurance.",
        "sets": "3 rounds of 1 minute",
        "instructions": "Keep your core tight and jump continuously at a steady pace."
      },
      {
        "name": "Burpees",
        "description": "A high-intensity movement that works the entire body.",
        "sets": "3 sets of 12 reps",
        "instructions": "Drop into a squat, jump into a push-up position, perform a push-up, then jump back up explosively."
      },
      {
        "name": "Mountain Climbers",
        "description": "A dynamic movement that targets core and cardio endurance.",
        "sets": "3 sets of 30 seconds",
        "instructions": "Keep your core tight and drive your knees toward your chest in a running motion."
      }
    ]
  },
  {
    "id": "5",
    "name": "Core & Abs",
    "category": "Core Training",
    "description": "A workout designed to strengthen the core and improve stability.",
    "instructions": "Perform each exercise with control, resting for 30-45 seconds between sets.",
    "exercises": [
      {
        "name": "Plank",
        "description": "An isometric exercise that builds core endurance.",
        "sets": "3 rounds of 45 seconds",
        "instructions": "Keep your body in a straight line and engage your core throughout."
      },
      {
        "name": "Russian Twists",
        "description": "A rotational core exercise targeting the obliques.",
        "sets": "3 sets of 20 reps (10 per side)",
        "instructions": "Keep your feet off the floor and twist your torso side to side."
      },
      {
        "name": "Leg Raises",
        "description": "An exercise that strengthens the lower abs.",
        "sets": "3 sets of 15 reps",
        "instructions": "Keep your lower back on the floor and raise your legs to 90 degrees before lowering them slowly."
      }
    ]
  },
  {
    "id": "6",
    "name": "Mobility & Stretching",
    "category": "Recovery",
    "description": "A stretching routine to improve flexibility and mobility.",
    "instructions": "Hold each stretch for 20-30 seconds, breathing deeply.",
    "exercises": [
      {
        "name": "Downward Dog",
        "description": "A yoga stretch that improves hamstring and shoulder flexibility.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Push your hips back, straighten your legs, and press your heels toward the ground."
      },
      {
        "name": "Hip Flexor Stretch",
        "description": "A stretch for the hip flexors and quadriceps.",
        "sets": "3 rounds of 30 seconds per side",
        "instructions": "Kneel on one knee, push your hips forward, and hold."
      }
    ]
  },
  {
    "id": "7",
    "name": "Athletic Performance",
    "category": "Sports Training",
    "description": "A workout focused on improving speed, agility, and explosiveness.",
    "instructions": "Perform each exercise with intensity, resting for 45-60 seconds between sets.",
    "exercises": [
      {
        "name": "Box Jumps",
        "description": "An explosive movement to build lower body power.",
        "sets": "3 sets of 12 reps",
        "instructions": "Jump onto a sturdy box, landing softly, then step down."
      },
      {
        "name": "Sled Push",
        "description": "A full-body movement for developing speed and endurance.",
        "sets": "3 rounds of 20 meters",
        "instructions": "Keep your back straight, lean forward, and push the sled as fast as possible."
      },
      {
        "name": "Lateral Cone Drills",
        "description": "A drill to improve agility and lateral movement.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Move side to side quickly, touching each cone in a controlled manner."
      }
    ]
  },
  {
    "id": "8",
    "name": "Bodyweight HIIT",
    "category": "High-Intensity Interval Training",
    "description": "A fast-paced bodyweight workout to burn fat and increase endurance.",
    "instructions": "Perform each exercise with full intensity for 30 seconds, then rest for 15 seconds.",
    "exercises": [
      {
        "name": "Jump Squats",
        "description": "A squat variation that builds explosive strength.",
        "sets": "3 sets of 30 seconds",
        "instructions": "Lower into a squat and explode upward, landing softly."
      },
      {
        "name": "Plank to Shoulder Taps",
        "description": "A dynamic core and stability exercise.",
        "sets": "3 sets of 30 seconds",
        "instructions": "Hold a plank and alternate tapping your shoulders with opposite hands."
      },
      {
        "name": "Lunges",
        "description": "A unilateral movement for leg strength and balance.",
        "sets": "3 sets of 12 reps per leg",
        "instructions": "Step forward, lower until your back knee is just above the ground, and push back up."
      }
    ]
  },
  {
    "id": "9",
    "name": "Endurance Training",
    "category": "Cardio & Stamina",
    "description": "A workout focused on building cardiovascular endurance and stamina.",
    "instructions": "Maintain a steady pace, focusing on consistency and breathing.",
    "exercises": [
      {
        "name": "Treadmill Running",
        "description": "A steady-state cardio workout to improve endurance.",
        "sets": "30 minutes at moderate intensity",
        "instructions": "Run at a steady pace, keeping your breathing controlled."
      },
      {
        "name": "Rowing Machine",
        "description": "A full-body cardio exercise that targets endurance.",
        "sets": "4 rounds of 5 minutes",
        "instructions": "Row at a steady pace, focusing on smooth strokes."
      },
      {
        "name": "Cycling",
        "description": "A low-impact endurance exercise.",
        "sets": "45 minutes at moderate intensity",
        "instructions": "Keep a consistent cadence and adjust resistance as needed."
      }
    ]
  },
  {
    "id": "10",
    "name": "Flexibility & Yoga",
    "category": "Recovery & Mobility",
    "description": "A routine designed to improve flexibility, reduce stress, and aid recovery.",
    "instructions": "Hold each position for 20-30 seconds, breathing deeply.",
    "exercises": [
      {
        "name": "Child’s Pose",
        "description": "A relaxation stretch for the back and hips.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Sit back onto your heels, stretch your arms forward, and relax."
      },
      {
        "name": "Seated Forward Fold",
        "description": "A hamstring and lower back stretch.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Sit with legs extended and reach forward toward your toes."
      },
      {
        "name": "Cat-Cow Stretch",
        "description": "A mobility movement for spinal flexibility.",
        "sets": "3 rounds of 30 seconds",
        "instructions": "Alternate between arching and rounding your back in a smooth motion."
      }
    ]
  }
]
